Revit 2024 API
BuiltInFailures.EditingFailures.PinnedObjectSomeDeleted Property
 Some pinned objects were deleted while others were not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PinnedObjectSomeDeleted { get; }
Visual Basic
Public Shared ReadOnly Property PinnedObjectSomeDeleted As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PinnedObjectSomeDeleted {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace